VA_NAME = 'Линда'
VA_VOICE = 'kseniya' # aidar, eugene, baya, kseniya, xenia, random

VA_VER = "2.0"

VA_ALIAS = ('линда', 'лена', 'лина', 'лида', 'лента', 'ленда', 'линна', 'венда', 'винда', 'глинда', 'блин да', 'линдер', 'алина',
    'линды', 'слинга', 'линзы', 'ринга', 'тренда', 'ли на', 'ли да', 'лены', 'линды', 'линга', 'лилль', 'лига', 'олинда',
    'джарвис', 'жара с', 'жаре с', 'жар из', 'ярость', 'чавес', 'через час', 'чарльз', 'джонс')

VA_TBR = ('скажи', 'ответь', 'произнеси', 'расскажи', 'пожалуйста')

VA_CMD_LIST = {
    "callme": VA_ALIAS,
    "sayhello": ('привет', 'здравствуй', 'холлоу', 'дарова', 'приветик', 'доброе утро', 'добрый обед',
        'добрый день', 'добрый вечер', 'добрая ночь', 'доброго времени суток'),
    "changemyvoice": ('измени свой голос', 'поменяй свой голос', 'переключись на другой голос'),
    "whatdoing": ('что ты делаешь', 'чем занимаешься', 'что делаешь', 'на что тратишь время', 'куда тратишь время', 'как время проводишь',
        'как день проходит', 'как проходит вечер'),
    "doyoulove": ('ты любишь', 'тебе нравится'),
    "thankyou": ('спасибо', 'благодарю', 'очень благодарен', 'благодарствую', 'мерси', 'спасибочки', 'дякую', 'ништяк'),

    "piano": ('сыграй на пианино', 'включи музыку на пианино', 'поставь пианино', 'включай пианино', 'открой пианино'),

    "help": ('список команд', 'команды', 'что ты умеешь', 'твои навыки', 'навыки'),
    "ctime": ('время', 'текущее время', 'сейчас времени', 'который час'),
    "open_browser": ('открой браузер', 'запусти браузер', 'открой гугл хром', 'гугл хром', 'открой хром'),
    "cubedesk": ('открой таймер для кубик рубика', 'открой таймер для спит кубика'),
    "open_telegram": ('открой телеграм', 'запусти телеграм', 'включи телеграм'),

    "lockscreen": ('заблокируй компьютер', 'заблокируй ноутбук', 'заблокируй экран', 'выключи экран'),
    "alttab": ('переключи окно', 'открой другое окно', 'включи другое окно', 'переместись в другое окно'),
    "hideallwindows": ('сверни все окна', 'спрячь все окна', 'опусти все окна'),
    "showallwindows": ('разверни все окна', 'покажи все окна', 'подними все окна', 'верни все окна'),
    "closewindow": ('закрой окно', 'заверши окно', 'закрой программу', 'закрой приложение'),
    "chromenewtab": ('открой новую вкладку в гугле', 'открой новую вкладку в хроме', 'открой новую вкладку в браузере',
        'создать новую вкладку в гугле', 'создать новую вкладку в хроме', 'создать новую вкладку в браузере'),
    "volumeup": ('сделай звук погромче', 'сделай звук громче', 'увеличить громкость', 'сделай громкость выше',
        'повысить громкость', 'повысить звук', 'громче'),
    "volumedown": ('сделай звук потише', 'сделай звук тише', 'понизить громкость', 'опустить громкость', 'сделать громкость ниже',
        'понизить звук', 'уменьшить звук', 'убавить звук', 'тише', 'потише'),
    "volumemute": ('вырубить звук', 'выключить звук', 'убрать звук', 'громкость на ноль', 'выключи динамик', 'не издавать звук',
        'закрой рот', 'заткнись', 'замолчи', 'тихо', 'молчать', 'замолкни', 'заткни компьютер', 'включить режим без звука', 'тихий режим'),
    "typewrite": ('напиши', 'вбей'),
    "pressspace": ('пробел', 'пауза', 'продолжить', 'стоп', 'остановить видео', 'видео на паузу', 'нажать на паузу', 'запустить видео', 'продолжиьт видео'),

    "joke": ('расскажи анекдот', 'рассмеши', 'шутка', 'расскажи шутку', 'пошути', 'развесели', 'мне грустно', 'я грущу', 'я грустный'),
    "weather": ('какая погода', 'погода в городе'),
    "wiki": ('что такое', 'кто такая', 'кто такой', 'что значит', 'чему равна'),
    "takephoto": ('сфотографируй меня', 'сфотографируй нас', 'сфоткай', 'сделай снимок с камеры', 'сделай фото'),
    "exit": ('выключись', 'закрой себя', 'уходи', 'выйди', 'уйди', 'выходи', 'пока', 'прощай', 'досвидания',
        'вырубайся', 'выключайся', 'иди спать', 'вырубись', 'отстань'),
    "restart": ('перезапустись', 'перезапусти себя', 'рестартнись', 'запустись сначала', 'перезагрузись', 'перезагрузи себя'),
    "turnoffpc": ('выключить компьютер', 'выключить ноутбук', 'выключить систему', 'завершение работы', 'конец сеанса', 'конец работы',
        'вырубай ноутбук')
}